<img src="images/usm.jpg" width="480" height="240" align="left"/>

# MAT281 - Laboratorio N°04

## Objetivos de la clase

* Reforzar los conceptos básicos de los módulos de pandas.

## Contenidos

* [Problema 01](#p1)
* [Problema 02](#p2)

## Problema 01


<img src="https://image.freepik.com/vector-gratis/varios-automoviles-dibujos-animados_23-2147613095.jpg" width="360" height="360" align="center"/>


EL conjunto de datos se denomina `Automobile_data.csv`, el cual contiene información tal como: compañia, precio, kilometraje, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [2]:
import pandas as pd
import os

In [45]:
# cargar datos
df = pd.read_csv(os.path.join("data","Automobile_data.csv")).set_index('index')
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. Elimine los valores nulos (Nan)

In [47]:
#Asumo que debo eliminar las columnas con valores NaN

df=df[df['price'].notnull()]                # Busco los nulls en precios y guardo las que no tengan NaN
df.isnull().sum()                           # Sumo los NaN de cada columna para revisar si queda alguno

company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               0
dtype: int64

2. Encuentra el nombre de la compañía de automóviles más cara

In [74]:
aux = df.groupby('company')  
aux = aux[['price']].mean().reset_index()
m=0
k=0
for index, row in aux.iterrows():
    if m<aux.price[index]:
        m=aux.price[index]
        k=aux.company[index]
print(k)

porsche

3. Imprimir todos los detalles de Toyota Cars

In [98]:
aux=df.groupby('company')

4. Cuente el total de automóviles por compañía

In [104]:
aux = df.groupby('company')

5. Encuentra el coche con el precio más alto por compañía

6. Encuentre el kilometraje promedio (**average-mileage**) de cada compañía automotriz

In [100]:
aux = df.groupby('company')  
aux[['average-mileage']].mean().reset_index()

          company  average-mileage
0     alfa-romero        20.333333
1            audi        20.000000
2             bmw        19.000000
3       chevrolet        41.000000
4           dodge        31.000000
5           honda        26.333333
6           isuzu        24.000000
7          jaguar        14.333333
8           mazda        28.000000
9   mercedes-benz        18.000000
10     mitsubishi        29.500000
11         nissan        31.400000
12        porsche        17.000000
13         toyota        28.714286
14     volkswagen        31.750000
15          volvo        23.000000

7. Ordenar todos los autos por columna de precio (**price**)

In [103]:
aux=df.sort_values(by=['price'])
aux.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0

## Problema 02


Siguiendo la temática de los automóviles, resuelva los siguientes problemas:

#### a) Subproblema 01
A partir de los siguientes diccionarios:

In [2]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'],
              'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 
                'Price': [29995, 23600, 61500 , 58900]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
* Concatene ambos dataframes (**carsDf**) y añada una llave ["Germany", "Japan"], según corresponda.

In [107]:
carsDf1 = pd.DataFrame(
    [
        ["Germany", "Ford", 23845],
        ["Germany", "Mercedes", 171995],
        ["Germany", "BMV", 135925],
        ["Germany", "Audi", 71400]        
    ], columns = ["Country" , "Company", "price"]
)

carsDf2 = pd.DataFrame(
    [
        ["Japan", "Toyota", 29995],
        ["Japan", "Honda", 23600],
        ["Japan", "Nissan", 61500],
        ["Japan", "Mitsubishi", 58900]        
    ], columns = ["Country" , "Company", "price"]
)

result = pd.concat([carsDf1, carsDf2], axis=0, sort=False)
result

   Country     Company   price
0  Germany        Ford   23845
1  Germany    Mercedes  171995
2  Germany         BMV  135925
3  Germany        Audi   71400
0    Japan      Toyota   29995
1    Japan       Honda   23600
2    Japan      Nissan   61500
3    Japan  Mitsubishi   58900

#### b) Subproblema 02

A partir de los siguientes diccionarios:

In [4]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
*  Junte ambos dataframes (**carsDf**) por la llave **Company**.

In [109]:
carsDf1 = pd.DataFrame(
    [
        ["Ford", 23845],
        ["Mercedes", 171995],
        ["BMV", 135925],
        ["Audi", 71400]        
    ], columns = ["Company", "price"]
)

carsDf2 = pd.DataFrame(
    [
        ["Ford", 141],
        ["Mercedes", 80],
        ["BMV", 182],
        ["Audi", 160]        
    ], columns = ["Company", "horsepower"]
)

result = pd.merge(carsDf1, carsDf2, on='Company')
result

    Company   price  horsepower
0      Ford   23845         141
1  Mercedes  171995          80
2       BMV  135925         182
3      Audi   71400         160